#include "cjCms.h"

namespace cj {

//--------------------------------------------------------------------------------------------------
//----------          class WebSite          -------------------------------------------------------
//--------------------------------------------------------------------------------------------------

WebSite::WebSite(SiteManager *manager, string host) {
	this->manager = manager;
	this->host = host;
	login = "";
	userId = 0;
	tplId = 0; //0 - кастомный дизайн
}

}
